UPDATE t_p80499285_psot_realization_pro.wr_employees
SET extra_data = jsonb_build_object(
  'Наименование (краткое)', fio,
  'Полное наименование', CASE fio
    WHEN 'Ведущий геолог на поверхности' THEN 'Ведущий геолог на поверхности'
    WHEN 'Начальник фабрики' THEN 'Начальник фабрики'
    WHEN 'Заместитель начальника фабрики' THEN 'Заместитель начальника фабрики'
    WHEN 'Гидротехник' THEN 'Гидротехник'
    WHEN 'Главный маркшейдер' THEN 'Главный маркшейдер'
    WHEN 'Фельдшер' THEN 'Фельдшер'
    WHEN 'Начальник лаборатории' THEN 'Начальник лаборатории'
    WHEN 'Начальник ОКС' THEN 'Начальник отдела'
    WHEN 'Заведующий складом(центральный)' THEN 'Заведующий складом (центральным)'
    WHEN 'Кладовщик (грузчик)' THEN ''
    WHEN 'Оператор АЗС' THEN 'Оператор заправочной станции'
    WHEN 'Начальник ОТК' THEN 'Начальник отдела технического контроля'
    WHEN 'Заместитель начальника ОТК' THEN 'Заместитель начальника отдела технического контроля'
    WHEN 'Контролер ОТК' THEN 'Контролёр качества продукции и технологического процесса 5 разряда'
    WHEN 'Пробоотборщик ОТК' THEN 'Пробоотборщик 4 разряда'
    WHEN 'Раздатчик ВМ' THEN 'Раздатчик взрывчатых материалов 3 разряда, занятый полный рабочий день на подземных работах'
    WHEN 'Ламповщик' THEN 'Ламповщик'
    WHEN 'Обмотчик элементов электрических машин' THEN 'Обмотчик элементов электрических машин 5 разряда'
    WHEN 'Заведующий складом ВМ' THEN 'Заведующий складом ВМ'
    WHEN 'Заместитель генерального директора по БиС' THEN 'Заместитель генерального директора по безопасности и сохранности'
    WHEN 'Инспектор БиС.' THEN 'Инспектор по безопасности и сохранности'
    ELSE fio
  END
)
WHERE sheet_name = 'Периодичность МО' AND archived = FALSE;